---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementOutSideOfHost
source: html/b15e1ee3-c138-9fdd-3757-2e46a92fd5d9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.AreaReinforcementOutSideOfHost Property

Area Reinforcement is sketched completely outside of its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaReinforcementOutSideOfHost { get; }
```